Repository: Max-E-Ivanov/SimpleMiner
Catalog: SimpleMiner/Properties/Resources.*.resx
Languages: ru_ru, uk_ua

# ClmCfgCustomCommandBtn
source: Generate
ru_ru: Сгенерировать из параметров
uk_ua: Згенерувати з параметрів

# ClmCFgCustomCommandCb
source: Custom command
ru_ru: Команда задана вручную
uk_ua: Команда задана вручну

# ClmCfgTabCustomCommand
source: Custom command
ru_ru: Команда вручную
uk_ua: Команда вручну

# CloseButton
source: Close
ru_ru: Закрыть
uk_ua: Закрити

# ErrorCaption
source: Error
ru_ru: Ошибка
uk_ua: Помилка

# EthCreateWalletLink
source: Create ethWallet
ru_ru: Создать кошелек
uk_ua: Створити гаманець

source: EthPool
ru_ru: Пул
uk_ua: Пул

source: EthWallet
ru_ru: Кошелек
uk_ua: Гаманець

# EthWorker
source: Worker
ru_ru: Воркер
uk_ua: Робітник

# HideDetailsButton
source: Hide details
ru_ru: Спрятать детали
uk_ua: Сховати деталі

# MinerCfgCaption
source: Miner parameters
ru_ru: Параметры майнера
uk_ua: Параметри майнеру

# ShowDetailsButton
source: Show details
ru_ru: Показать детали
uk_ua: Показати деталі

# tabAbout
source: About
ru_ru: О программе
uk_ua: Про програму

# tabEthereum
source: Ethereum
ru_ru: Эфир
uk_ua: Эфір

# tabOptions
source: Setting
ru_ru: Настройки
uk_ua: Налаштування

# ttClmCfgCustomCommandBtn
source: Generate command for miner
ru_ru: Сгенерировать команду на основе заданых параметров
uk_ua: Згенерувати команду на онові заданих параметрів

# ttClmCFgCustomCommandCb
source: Use custom command for miner. In this mode other settings are ignored
ru_ru: Использовать команду заданую вручную. В этом режиме остальные параметры будут проигнорированы
uk_ua: Використовувати команду задану вручну. В цьому режимі інші параметри будуть проігноровані

# ttConfigButton
source: Extended parameters
ru_ru: Расширенные параметры
uk_ua: Розширені параметри

# ttErrorClose
source: Press to close error dialog
ru_ru: Нажмите, что бы закрыть окно
uk_ua: Натисніть, щоб закрити вікно

# ttErrorDetails
source: Press to show additional details
ru_ru: Нажмите, что бы показать дополнительные детали
uk_ua: Натисніть, щоб показати додаткові відомості

# ttEthPool
source: Pool address for Ethereum mining
ru_ru: Адреса пулов для майнинга эфира
uk_ua: Адреси пулів для майнінгу Ефіру

# ttEthWallet
source: Address of your Ethereum wallet
ru_ru: Адрес вашего кошелька для Эфира. Также имя воркера и другие опции, если пул их поддерживает
uk_ua: Адреса гаманця для Ефіру

# ttEthWorker
source: Worker name
ru_ru: Имя работника (требуется некоторыми пулами)
uk_ua: Ім'я робітника (вимагається для деяких пулів)

# ttStartButton
source: Press for start mining
ru_ru: Нажмите для начала майнинга
uk_ua: Натисніть для початку манінгу

# ttStopButton
source: Press fro stop mining
ru_ru: Нажмите что бы остановить майнинг
uk_ua: Натисніть щоб зупинити манінг

# ApplayButton
source: Applay
ru_ru: Применить
uk_ua: Прийняти

# CancelButton
source: Cancel
ru_ru: Отменить
uk_ua: Скасувати

# DefaultsButton
source: Restore defaults
ru_ru: По умолчанию
uk_ua: За замовчуванням

# ttApplayButton
source: Applay changes and close form
ru_ru: Применить изменения и закрыть окно
uk_ua: Прийняти зміни та закрити вікно

# ttCancelButton
source: Cancel changes and close form
ru_ru: Отменить изменения и закрыть откно
uk_ua: Скасувати зміни та закрити вікно

# ttDefaultsButton
source: Restore default settings
ru_ru: Восстановить значения по умолчанию
uk_ua: Повернутись до значень за замовчуванням

# ClmCfgSecondCoin
source: Mine Second coin
ru_ru: Майнить вторую монету

# ClmCfgTabCoins
source: Coins
ru_ru: Монеты

# ttClmCfgAllcoins
source: Check to be able to mine Ethereum forks, in this mode miner will use some default pools for devfee Ethereum mining
ru_ru: Отметьте чтобы иметь возможность добывать форки Эфира

# ttClmCfgAllPools
source: Check if miner does not want to mine on specified pool (because it cannot mine devfee on that pool), but you agree to use some default pools for devfee mining
ru_ru: Отметьте если майнер не хочет работать на указанном пуле

# ttClmCfgDcoin
source: Select second coin to mine in dual mode
ru_ru: Выбор второй монеты для добычи в dual-режиме. По умолчанию — «dcr»

# ttClmCfgDcri
source: Decred/Siacoin/Lbry/Pascal intensity, or Ethereum fine-tuning value in ETH-only ASM mode. Default value is 30, you can adjust this value to get the best Decred/Siacoin/Lbry mining speed without reducing Ethereum mining speed. You can also specify values for every card, for example "30,100,50"
ru_ru: Интенсивность добычи второй монеты (Decred, Siacoin, Lbry, Pascal) или значение точной настройки Ethereum в режиме ASM в режиме «только ETH», по умолчанию 30. Можно регулировать это значение для большей скорости добычи второй монеты без снижения скорости добычи Эфира. Можно устанавливать значение индивидуально для каждой карты, например: «30,100,50»

# ttClmCfgDcrt
source: Time period between Decred/Siacoin HTTP requests for new job, in seconds. Default value is 5 seconds
ru_ru: Период времени между Decred/Siacoin http-запросами новой работу, в секундах (по умолчанию 5 секунд)

# ttClmCfgDpool
source: Decred/Siacoin/Lbry/Pascal pool address. Use "http://" prefix for HTTP pools, "stratum+tcp://" for Stratum pools. If prefix is missed, Stratum is assumed. Decred: both Stratum and HTTP are supported. Siacoin: both Stratum and HTTP are supported, though note that not all Stratum versions are supported currently. Lbry: only Stratum is supported
ru_ru: Адрес пула для второй монеты (Decred, Siacoin, Lbry,Pascal). Используйте: «http://» для HTTP пулов, «stratum+tcp://» для Stratum пулов. Если префикс пропущен, предполагается Stratum. Decred: оба протокола Stratum и HTTP поддерживаются. Siacoin: оба протокола Stratum и HTTP поддерживаются, но не все версии Stratum поддерживаются на данный момент. Lbry: только Stratum поддерживается

# ttClmCfgDpsw
source: Password for Decred/Siacoin/Lbry/Pascal pool
ru_ru: Пароль для пула второй монеты (Decred, Siacoin, Lbry,Pascal), используйте «x», если не требуется пароль

# ttClmCfgDwal
source: Your Decred/Siacoin/Lbry/Pascal wallet address or worker name, it depends on pool
ru_ru: Адрес кошелька для второй монеты (Decred, Siacoin, Lbry) или имя воркера — в зависимости от пула

# ttClmCfgErate
source: Send Ethereum hashrate to pool
ru_ru: Отправлять на пул хешрейт Эфира

# ttClmCfgEsm
source: Ethereum Stratum mode
ru_ru: Режим протокола Стратум для Эфира

# ttClmCfgEstale
source: Send Ethereum stale shares to pool, it can increase effective hashrate a bit
ru_ru: Отправлять на пул просроченные (stale) шары Эфира, это может чуть улучшить эффективный хешрейт — некоторые пулы принимают такие шары и оплачивают за них, так как они иногда принимают участие в создании uncle-блоков

# ttClmCfgEtha
source: Ethereum algorithm mode for AMD cards. 0 - optimized for fast cards, 1 - optimized for slow cards, 2 - for gpu-pro Linux drivers. -1 - autodetect (default, automatically selects between 0 and 1). You can also set this option for every card individually, for example "-etha 0,1,0"
ru_ru: Алгоритм добычи Эфира для карт AMD: 0 — оптимизирован для быстрых карт; 1 — оптимизирован для медленных карт; 2 – для драйверов Linux gpu-pro; -1 (минус один, по умолчанию) — автоматический выбор режима, по умолчанию автоматически выбирается от 0 до 1. Можно устанавливать эти значения индивидуально для каждой карты, например: « 0,1,0»

# ttClmCfgEthi
source: Ethereum intensity. Default value is 8, you can decrease this value if you don't want Windows to freeze or if you have problems with stability. The most low GPU load is "-ethi 0". Also "-ethi" now can set intensity for every card individually, for example " 1,8,6"
ru_ru: Интенсивность добычи Эфира (по умолчанию «8»). Можно уменьшить, во избежание подтормаживаний Windows или при нестабильной работе. Наименьшая нагрузка на видеокарту при 0.Можно устанавливать значение индивидуально для каждой карты, например: «1,8,6»

# ttClmCfgPsw
source: Password for Ethereum pool, use "x" as password
ru_ru: Пароль для пула Эфира, укажите «x», как пароль

# ttClmCfgSolo
source: Use SOLO mode
ru_ru: Использовать СОЛО режим

# ttClmCfgWorker
source: Worker name, it is required for some pools
ru_ru: Имя Воркера, требуется на некоторых пулах

# ttClmCfgEtht
source: Time period between Ethereum HTTP requests for new job in solo mode, in milliseconds. Default value is 200ms
ru_ru: Период времени между http-запросами на новую работу в СОЛО, в миллисекундах (по умолчанию 200мс)

# ttClmCustomCommand
source: To change custom command click Extended parameters button
ru_ru: Команда для майнера. Что бы изменить ее нажмите кнопку <Расширенные параметры>
